In [1]:
import pandas as pd

In [17]:
brr = pd.DataFrame({'a':[1,2,3,4,5,6], 'b':[11,12,13,14,15,16], 'c':[101,102,103,104,105,106]}, index=[1001, 1002, 1003, 1004, 1005, 1006])

In [18]:
brr

      a   b    c
1001  1  11  101
1002  2  12  102
1003  3  13  103
1004  4  14  104
1005  5  15  105
1006  6  16  106

In [19]:
brr.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 1001 to 1006
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      int64
 1   b       6 non-null      int64
 2   c       6 non-null      int64
dtypes: int64(3)
memory usage: 192.0 bytes

In [20]:
brr.describe()

              a          b           c
count  6.000000   6.000000    6.000000
mean   3.500000  13.500000  103.500000
std    1.870829   1.870829    1.870829
min    1.000000  11.000000  101.000000
25%    2.250000  12.250000  102.250000
50%    3.500000  13.500000  103.500000
75%    4.750000  14.750000  104.750000
max    6.000000  16.000000  106.000000

In [21]:
brr['a']

1001    1
1002    2
1003    3
1004    4
1005    5
1006    6
Name: a, dtype: int64

In [22]:
type(brr)

pandas.core.frame.DataFrame

In [23]:
type(brr['a'])

pandas.core.series.Series

In [25]:
brr[['a']]

      a
1001  1
1002  2
1003  3
1004  4
1005  5
1006  6

In [26]:
type(brr[['a']])

pandas.core.frame.DataFrame

In [27]:
brr['a']>4

1001    False
1002    False
1003    False
1004    False
1005     True
1006     True
Name: a, dtype: bool

In [29]:
brr.head(2)

      a   b    c
1001  1  11  101
1002  2  12  102

In [30]:
brr.head()

      a   b    c
1001  1  11  101
1002  2  12  102
1003  3  13  103
1004  4  14  104
1005  5  15  105

In [31]:
brr.tail()

      a   b    c
1002  2  12  102
1003  3  13  103
1004  4  14  104
1005  5  15  105
1006  6  16  106

In [32]:
brr.tail(2)

      a   b    c
1005  5  15  105
1006  6  16  106

In [33]:
brr.loc[1003, 'b']

np.int64(13)

In [36]:
brr.loc[1003,['a','c']]

a      3
c    103
Name: 1003, dtype: int64

In [39]:
brr.loc[1003,['a','c']]

a      3
c    103
Name: 1003, dtype: int64